#+title: Dot Product Kernel in CUDA
#+author: Chunwei Yan
#+date: 2025-08-13
#+hugo_tags: "cuda" "basics" "tech"
#+hugo_draft: true
#+toc: nil

In this post, I will walk through some dot product kernels  and implement them interactively in this file using org-executor.

** PyTorch
The python version:

#+begin_src python :file ./_torch_check.py :command python3 %f
import torch
print(torch.__version__)
#+end_src
#+RESULTS:
  2.8.0a0+5228986c39.nv25.06

** Hardware

#+begin_src bash :file ./query_gpu_info.sh :key main :command bash ./query_gpu_info.sh
nvidia-smi --query-gpu=gpu_name,memory.total,memory.free,memory.used,driver_version,temperature.gpu,utilization.gpu --format=csv,noheader
#+end_src
#+RESULTS:
  NVIDIA H100 80GB HBM3, 81559 MiB, 81080 MiB, 0 MiB, 580.65.06, 41, 0 %

